#### Task 20 - Creation of DataFrame:

#### 1.What is Dataframe ? Write itâ€™s key Features and applications.

A DataFrame is a two-dimensional, mutable, tabular data structure commonly used in data analysis and manipulation. It consists of rows and columns, where each column can hold different types of data such as integers, floats, strings, or even other objects. 

#### Key Features of a DataFrame
1. **Tabular Structure**: Organized in rows and columns, resembling a table.
2. **Heterogeneous Data Types**: Columns can contain different types of data.
3. **Labeling**: Both rows and columns can be labeled for easier access.
4. **Indexing**: Efficiently index and slice data for manipulation.
5. **Data Manipulation**: Provides methods for filtering, aggregating, merging, and reshaping data.
6. **Integration**: Works well with other data sources like databases, CSV files, Excel sheets, etc.
7. **Handling Missing Data**: Tools to identify, fill, or drop missing values.
8. **Scalability**: Libraries such as Spark DataFrame offer distributed computing for handling big data.

#### Applications of DataFrames
1. **Data Cleaning**: Removing duplicates, handling missing values, and formatting data.
2. **Exploratory Data Analysis (EDA)**: Performing statistical operations and visualizing data insights.
3. **Machine Learning**: Preparing datasets for training and testing models.
4. **Data Transformation**: Aggregating, reshaping, and combining data for analysis.
5. **Big Data**: Handling massive datasets efficiently with frameworks like Spark.
6. **Finance**: Analyzing stock data, portfolio management, etc.
7. **Scientific Computing**: Manipulating experimental data in research and engineering.
8. **Web Data Scraping**: Organizing extracted web data for further analysis.

In [12]:
import numpy as np
import pandas as pd

#### 2.Create a series of the numpy and perform mean, median, mode, variance, and standard deviation on the array.

In [25]:
array = np.array([10, 20, 20, 30, 40, 10, 50, 20])
series = pd.Series(array)
print("Series :")
print(series)

print("Mean : ",series.mean())
print("Median : ",series.median())
print("Mode : ",series.mode())
print("Variance : ",series.var())
print("Standard deviation : ",series.std())

Series :
0    10
1    20
2    20
3    30
4    40
5    10
6    50
7    20
dtype: int32
Mean :  25.0
Median :  20.0
Mode :  0    20
dtype: int32
Variance :  200.0
Standard deviation :  14.142135623730951

#### 3.Create a Pandas DataFrame with the following data:
	data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        		 'Age': [25, 30, 35, 40],
        		 'Salary': [50000, 60000, 75000, 90000]}

In [29]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Salary': [50000, 60000, 75000, 90000]}

df = pd.DataFrame(data)
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000
3    David   40   90000

#### a.Print the 'Name' column from the above dataframe. Also Print the first two rows of the DataFrame.

In [31]:
df.Name

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [35]:
df[:2]

    Name  Age  Salary
0  Alice   25   50000
1    Bob   30   60000

#### b.Sort the DataFrame based on 'Age' in descending order and display it.

In [45]:
df.sort_values(by='Age', ascending = False)

      Name  Age  Salary
3    David   40   90000
2  Charlie   35   75000
1      Bob   30   60000
0    Alice   25   50000

#### c.Convert the above Pandas DataFrame into a CSV file named 'employees.csv'. Replace the index with the 'EmpID' column permanently.

In [49]:
df.to_csv('employees.csv')

In [51]:
df['EmpID'] = [101, 102, 103, 104]
df.set_index('EmpID', inplace=True)
df

          Name  Age  Salary
EmpID
101      Alice   25   50000
102        Bob   30   60000
103    Charlie   35   75000
104      David   40   90000

#### 4.Print the details of the person with the highest and lowest salary from the above dataframe.

In [60]:
df[df.Salary == df.Salary.max()]

        Name  Age  Salary
EmpID
104    David   40   90000

In [62]:
df[df.Salary == df.Salary.min()]

        Name  Age  Salary
EmpID
101    Alice   25   50000

#### a.Calculate and print the average age and salary.

In [64]:
df.Age.mean()

32.5

In [66]:
df.Salary.mean()

68750.0

#### b.Select and print the rows where Age is less than 35 and Salary is greater than 60000.

In [78]:
df[(df.Age < 35) & (df.Salary > 60000)]

Empty DataFrame
Columns: [Name, Age, Salary]
Index: []

#### 5.Create a Pandas DataFrame from the following dictionary
 	data = {'City': ['New York', 'London', 'Tokyo', 'Paris'],
        		 'Population': [8398748, 8982256, 37435191, 2140526],
        		 'Area_km2': [468.9, 1572, 2191, 105.4]}

In [80]:
data = {'City': ['New York', 'London', 'Tokyo', 'Paris'],
        'Population': [8398748, 8982256, 37435191, 2140526],
        'Area_km2': [468.9, 1572, 2191, 105.4]}

df = pd.DataFrame(data)
df

       City  Population  Area_km2
0  New York     8398748     468.9
1    London     8982256    1572.0
2     Tokyo    37435191    2191.0
3     Paris     2140526     105.4

#### a.Add a new column 'Population_Density' calculated as Population/Area_km2. Print the modified DataFrame.

In [82]:
df['Population_Density'] = df['Population'] / df['Area_km2']
df

       City  Population  Area_km2  Population_Density
0  New York     8398748     468.9        17911.597356
1    London     8982256    1572.0         5713.903308
2     Tokyo    37435191    2191.0        17085.892743
3     Paris     2140526     105.4        20308.595825

#### 6.Create a Pandas DataFrame with the following data:
    large_dict={
           'ID': np.arange(1, 100001),
           'Name': [f'Person_{i}' for i in range(1, 100001)],
           'Age': np.random.randint(18, 65, size=100000)
           'Salary': np.random.randint(40000, 120000, size=100000)
           'City': np.random.choice(['New York', 'London', 'Tokyo', 'Paris'], size=100000)
           }

In [18]:
large_dict = {
       'ID': np.arange(1, 100001),
       'Name': [f'Person_{i}' for i in range(1, 100001)],
       'Age': np.random.randint(18, 65, size=100000),
       'Salary': np.random.randint(40000, 120000, size=100000),
       'City': np.random.choice(['New York', 'London', 'Tokyo', 'Paris'], size=100000)
       }

emp_data = pd.DataFrame(large_dict)
emp_data

           ID           Name  Age  Salary      City
0           1       Person_1   50   86412     Tokyo
1           2       Person_2   40   40618     Tokyo
2           3       Person_3   28   42573     Tokyo
3           4       Person_4   31   47385     Paris
4           5       Person_5   45   59903  New York
...       ...            ...  ...     ...       ...
99995   99996   Person_99996   27  101140     Tokyo
99996   99997   Person_99997   27   73395  New York
99997   99998   Person_99998   28   48888     Tokyo
99998   99999   Person_99999   23   85474    London
99999  100000  Person_100000   44  114296     Paris

[100000 rows x 5 columns]

#### a.Convert the dataframe into both CSV & Excel files and read those files.

In [29]:
emp_data.to_csv('Employee_Data.csv',index=False)

emp = pd.read_csv('Employee_Data.csv')
emp

           ID           Name  Age  Salary      City
0           1       Person_1   50   86412     Tokyo
1           2       Person_2   40   40618     Tokyo
2           3       Person_3   28   42573     Tokyo
3           4       Person_4   31   47385     Paris
4           5       Person_5   45   59903  New York
...       ...            ...  ...     ...       ...
99995   99996   Person_99996   27  101140     Tokyo
99996   99997   Person_99997   27   73395  New York
99997   99998   Person_99998   28   48888     Tokyo
99998   99999   Person_99999   23   85474    London
99999  100000  Person_100000   44  114296     Paris

[100000 rows x 5 columns]

In [25]:
emp_data.to_excel('Employee_file.xlsx',sheet_name='Employee_2025',index=False)

In [27]:
emp_file = pd.read_excel('Employee_file.xlsx')
emp_file

           ID           Name  Age  Salary      City
0           1       Person_1   50   86412     Tokyo
1           2       Person_2   40   40618     Tokyo
2           3       Person_3   28   42573     Tokyo
3           4       Person_4   31   47385     Paris
4           5       Person_5   45   59903  New York
...       ...            ...  ...     ...       ...
99995   99996   Person_99996   27  101140     Tokyo
99996   99997   Person_99997   27   73395  New York
99997   99998   Person_99998   28   48888     Tokyo
99998   99999   Person_99999   23   85474    London
99999  100000  Person_100000   44  114296     Paris

[100000 rows x 5 columns]

#### 7.Display information about the DataFrame. And show the last ten rows of the dataframe.

In [33]:
emp_data.info

<bound method DataFrame.info of            ID           Name  Age  Salary      City
0           1       Person_1   50   86412     Tokyo
1           2       Person_2   40   40618     Tokyo
2           3       Person_3   28   42573     Tokyo
3           4       Person_4   31   47385     Paris
4           5       Person_5   45   59903  New York
...       ...            ...  ...     ...       ...
99995   99996   Person_99996   27  101140     Tokyo
99996   99997   Person_99997   27   73395  New York
99997   99998   Person_99998   28   48888     Tokyo
99998   99999   Person_99999   23   85474    London
99999  100000  Person_100000   44  114296     Paris

[100000 rows x 5 columns]>

In [37]:
emp_data.tail(10)

           ID           Name  Age  Salary      City
99990   99991   Person_99991   30   82315     Paris
99991   99992   Person_99992   44   83766  New York
99992   99993   Person_99993   30   94218     Paris
99993   99994   Person_99994   64   58963     Tokyo
99994   99995   Person_99995   41   47641     Tokyo
99995   99996   Person_99996   27  101140     Tokyo
99996   99997   Person_99997   27   73395  New York
99997   99998   Person_99998   28   48888     Tokyo
99998   99999   Person_99999   23   85474    London
99999  100000  Person_100000   44  114296     Paris

#### a.Get statistical information about the numeric columns from the above dataframe.

In [39]:
emp_data.describe()

                  ID           Age         Salary
count  100000.000000  100000.00000  100000.000000
mean    50000.500000      41.03731   79875.701060
std     28867.657797      13.54051   23077.162497
min         1.000000      18.00000   40000.000000
25%     25000.750000      29.00000   59910.000000
50%     50000.500000      41.00000   79714.000000
75%     75000.250000      53.00000   99793.000000
max    100000.000000      64.00000  119998.000000

#### 8.Create a Pandas DataFrame with columns 'City', 'Temperature', and 'Humidity' containing the following data:
    City                          Temperature                          Humidity
    New York                           75                                 60
    Chica                              68                                 55
    Los Angeles                        85                                 45
    Miami                              80                                 70

In [52]:
data = {'City': ['New York', 'Chica', 'Los Angeles', 'Miami'],
        'Temperature': [75, 68, 85, 80],
        'Humidity': [60, 55, 45, 70]}

df = pd.DataFrame(data)
df

          City  Temperature  Humidity
0     New York           75        60
1        Chica           68        55
2  Los Angeles           85        45
3        Miami           80        70

#### a.Display the rows where the Temperature is above 70.

In [54]:
df[df.Temperature > 70]

          City  Temperature  Humidity
0     New York           75        60
2  Los Angeles           85        45
3        Miami           80        70

#### b.Display the rows where the Humidity is below 60.

In [56]:
df[df.Humidity < 60]

          City  Temperature  Humidity
1        Chica           68        55
2  Los Angeles           85        45

#### c.Display city with temperature 68 and humidity 55.

In [66]:
df[(df.Temperature == 68) & (df.Humidity == 55)]

    City  Temperature  Humidity
1  Chica           68        55

#### 9.Add column 'Category' in the dataframe.
           {'Category': ['A', 'B', 'C', 'A']}

In [81]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Salary': [50000, 60000, 75000, 90000]}

df = pd.DataFrame(data)
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000
3    David   40   90000

In [83]:
df['Category'] = ['A', 'B', 'C', 'A']
df

      Name  Age  Salary Category
0    Alice   25   50000        A
1      Bob   30   60000        B
2  Charlie   35   75000        C
3    David   40   90000        A

#### a.Find and display the unique values in the 'Category' column.

In [85]:
df['Category'].unique

<bound method Series.unique of 0    A
1    B
2    C
3    A
Name: Category, dtype: object>

#### b.Display only the rows where 'Salaries' are greater than 60000.

In [87]:
df[df.Salary > 60000]

      Name  Age  Salary Category
2  Charlie   35   75000        C
3    David   40   90000        A

#### 10.Create a Pandas DataFrame with columns 'City', 'Population', and 'Area' containing the following data:
		City               Population        Area
		New York            8398748          468.9
		Chicago             2716000          227.6
		Los Angeles         3976322          1213.9
		Houston             2328066          599.6

In [93]:
data = {'City': ['New York', 'Chicago', 'Los Angeles', 'Houston'],
        'Population': [8398748, 2716000, 3976322, 2328066],
        'Area': [468.9, 227.6, 1213.9, 599.6]}

df = pd.DataFrame(data)
df

          City  Population    Area
0     New York     8398748   468.9
1      Chicago     2716000   227.6
2  Los Angeles     3976322  1213.9
3      Houston     2328066   599.6

#### a.Sort the DataFrame based on 'Population' in descending order and display it.

In [97]:
df.sort_values(by='Population', ascending = False)

          City  Population    Area
0     New York     8398748   468.9
2  Los Angeles     3976322  1213.9
1      Chicago     2716000   227.6
3      Houston     2328066   599.6

#### 11. Create a Pandas DataFrame with columns 'Category', 'Price', and 'Quantity' containing the following data:


                    Category	        Price	          Quantity
                    Electronics     	500      	      10
                    Clothing          	 50      	      25
                    Electronics     	800      	       5
                    Clothing         	 30       	      30

In [104]:
data = {'Category': ['Electronics', 'Clothing', 'Electronics', 'Clothing'],
        'Price': [500, 50, 800, 30],
        'Quantity': [10, 25, 5, 30]}

df = pd.DataFrame(data)
df

      Category  Price  Quantity
0  Electronics    500        10
1     Clothing     50        25
2  Electronics    800         5
3     Clothing     30        30

#### a.Create a 'Total value' column and calculate the total value for each category by multiplying 'Price' and 'Quantity'. Display the DataFrame

In [109]:
df['Total value'] = df['Price'] * df['Quantity']

In [111]:
df

      Category  Price  Quantity  Total value
0  Electronics    500        10         5000
1     Clothing     50        25         1250
2  Electronics    800         5         4000
3     Clothing     30        30          900